Tekla.Structures.Analysis.AnalysisDesignParameterMulti
The AnalysisDesignParameterMulti class contains information related to analysis design parameters with multi values.

Tekla.Structures.Analysis.AnalysisDesignParameterMulti.multiValueCount
The multi value count of the analysis design parameter.

Tekla.Structures.Analysis.AnalysisDesignParameterMulti.values
The multi values of the analysis design parameter.

Tekla.Structures.Analysis.AnalysisDesignParameterMulti.#ctor(System.Int32)
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisDesignParameterMulti class.
materialType:
The material type of the analysis design parameter.

Tekla.Structures.Analysis.AnalysisDesignParameterMulti.#ctor(System.String,System.Int32,Tekla.Structures.Identifier)
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisDesignParameterMulti class.
analysisModelName:  The analysis model name.
parameterId:  The analysis design parameter ID.
partId:  The father part ID.

Tekla.Structures.Analysis.AnalysisDesignParameterMulti.MultiValueCount
Gets the multi value count of the analysis design parameter.

Tekla.Structures.Analysis.AnalysisDesignParameterMulti.GetValue(System.Int32)
Gets the value specified by the index of the analysis design parameter.
index:
The index of the value.
Returns:
The value at the index.

Tekla.Structures.Analysis.AnalysisDesignParameterMulti.SetValue(System.Int32,System.Double)
Sets the value specified by the index of the analysis design parameter.
index:
The index of the value.
value:
The value.

Tekla.Structures.Analysis.AnalysisDesignParameterMulti.Select
Selects an analysis design parameter.

Tekla.Structures.Analysis.AnalysisDesignParameterMulti.Modify
Modifies an analysis design parameter.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisDesignParameterMulti.SetMultiValueCount(System.Int32)
Sets the multi value count of the analysis design parameter.
count:
The count.

Tekla.Structures.Analysis.AnalysisDesignParameterMulti.SelectInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisDesignParameterMulti.ModifyInstance
DO NOT USE! For internal usage only!